
/**
 * 招生来源
 */
export enum Source {
  微信转发 = 0,
  微信公众号 = 1,
  发传单 = 2,
  搜索引擎 = 3,
  小区活动 = 4,
  家长推荐 = 5,
  员工推荐 = 6,
  微官网小程序 = 7,
  学校到访 = 8,
  电话咨询 = 9,
  其它 = 10
}

/**
 * 家长关系
 */

export enum FamilyRelation {
  爸爸 = 0,
  妈妈 = 1,
  爷爷 = 2,
  奶奶 = 3,
  外公 = 4,
  外婆 = 5,
  其它 = 6
}

/**
 * 招生学生状态
 */
export enum PreStatus {
  意向生 = 0,
  预报名 = 1,
  正式报名 = 2
}

/**
 * 意向程度
 */
export enum IntentionDegree {
  无意向 = 0,
  不明确 = 1,
  意向低 = 2,
  意向中 = 3,
  意向高 = 4
}

/**
 * 性别
 */
export enum Sex {
  男 = 1,
  女 = 2
}

/**
 * 学生状态
 */
export enum StudentStatus {
  在校 = 0,
  转校 = 1,
  休学 = 2,
  退学 = 3,
  停学 = 4,
  毕业 = 5,
  结业 = 6,
  死亡 = 7,
  保留入学资料 = 8,
  开除 = 9,
  下落不明 = 10,
  其他 = 11
}